			 /*TITLE TargetInit.c*/
/****************************************Copyright (c)**************************************************
**                                       CUIT
**                                 
**                                 http://www.cuit.edu.cn
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: TargetINIT.c
**创   建   人: 李茂
**最后修改日期: 2012年12月15日
**描        述: lpc2138（飞利浦的ARM）目标板特殊的代码，包括异常处理程序和目标板初始化程序
**              每个工程应当具有这个文件的拷贝，用户根据程序的需要修改本文件。
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 李茂
** 版  本: v1.0
** 日　期: 2012年12月15日
** 描　述: 原始版本
********************************************************************************************************/

#define IN_TARGET
#include <lpc213x.h>
#include "..\includes.h"
#define  Fpclk  12000000		/*表示用户最终希望PLL产生的外围总线频率*/
#define  Fcclk  60000000	 /*用户最终希望PLL产生的CPU总线频率*/
#define  Fosc   12000000     /*用户目标版的输入频率*/
/*********************************************************************************************************
** 函数名称: IRQ_Exception
** 功能描述: 中断异常处理程序，用户根据需要自己改变程序
**
** 输　入: 无
**
** 输　出: 无
**         
** 全局变量: 无
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2004年2月2日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void IRQ_Exception(void)
{
    while(1);                   // 这一句替换为自己的代码
}

/*********************************************************************************************************
** 函数名称: FIQ_Exception
** 功能描述: 快速中断异常处理程序，用户根据需要自己改变程序
**           
** 输　入: 无
**
** 输　出: 无
**         
** 全局变量: 无
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2004年2月2日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void FIQ_Exception(void)
{
    while(1);                   // 这一句替换为自己的代码
}

/*********************************************************************************************************
** 函数名称: Timer0_Exception
** 功能描述: 定时器0中断服务程序
** 输　入: 无
**
** 输　出: 无
**         
** 全局变量: 无
** 调用模块: OSTimeTick
**
** 作　者: 陈明计
** 日　期: 2004年2月2日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void Timer0_Exception(void)
{
    T0IR = 0x01;
    VICVectAddr = 0;            // 通知中断控制器中断结束
    OSTimeTick();
}

/*********************************************************************************************************
** 函数名称: Timer0Init
** 功能描述: 定时器0初始化
** 输　入: 无
**
** 输　出: 无
**         
** 全局变量: 无
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2002年4月4日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void Timer0Init(void)
{
    T0IR = 0xffffffff;
    T0TC = 0;
    T0TCR = 0x01;
    T0MCR = 0x03;
    T0MR0 = (Fpclk / OS_TICKS_PER_SEC);
 }

/*********************************************************************************************************
** 函数名称: VICInit
** 功能描述: 向量中断控制器初始化
** 输　入: 无
**
** 输　出: 无
**         
** 全局变量: 无
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2004年2月2日
**-------------------------------------------------------------------------------------------------------
** 修改人:李茂 
** 日　期: 2012年12月22日
*  描述：VICIntSelect：中断选择寄存器，为1表示FIQ，0表示IRQ
*
*
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void VICInit(void)
{
    //extern void IRQ_Handler(void);
    //extern void Timer0_Handler(void);

    VICIntEnClr = 0xffffffff;
   // VICDefVectAddr = (INT32U)IRQ_Handler;

    //VICVectAddr0 = (INT32U)Timer0_Handler;
    //VICVectCntl0 = (0x20 | 0x04);
    //VICIntEnable = 1 << 4;
 }

/*********************************************************************************************************
** 函数名称: TargetInit
** 功能描述: 目标板初始化代码，在需要的地方调用，根据需要改变
** 输　入: 无
**
** 输　出: 无
**         
** 全局变量: 无
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2004年2月2日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void TargetInit(void) /*由汇编转入到此处*/
{
    OS_ENTER_CRITICAL();
    srand((INT32U) TargetInit);
    VICInit();
    Timer0Init();
	
  VICIntSelect=0x00;		  //中断全部设置为ＩＲＱ
  VICVectCntl8=0x20|4;	  //第8优先级的中断分配给了Timer0，向量ＩＲＱ使能
  VICVectAddr8=(unsigned int) IRQ_Timer0;	 //将第8优先级的地址赋值为TIMER0中断入口地址
  VICIntEnable=1<<4;

    OS_EXIT_CRITICAL();
}

/*********************************************************************************************************
** 函数名称: InitialiseUART0
** 功能描述: 设置串口0 
** 输　入: bps：波特率
**
** 输　出: 无
**         
** 全局变量: 无
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2004年2月2日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/

        void InitialiseUART0(INT32U bps)
{   
    INT16U Fdiv;
    
    PINSEL0 = (PINSEL0 & 0xfffffff0) | 0x05;    /* 选择管脚为UART0 */

    U0LCR = 0x80;                               /* 允许访问分频因子寄存器 */
    Fdiv = (Fpclk / 16) / bps;                  /* 设置波特率 */
    U0DLM = Fdiv / 256;                         
    U0DLL = Fdiv % 256;                     
    U0LCR = 0x03;                               /* 禁止访问分频因子寄存器 */
                                                /* 且设置为8,1,n */
    U0IER = 0x00;                               /* 禁止中断 */
    U0FCR = 0x00;                               /* 初始化FIFO */
} 

/*********************************************************************************************************
** 函数名称: TargetResetInit
** 功能描述: 调用main函数前目标板初始化代码，根据需要改变，不能删除
** 输　入: 无
**
** 输　出: 无
**         
** 全局变量: 无
** 调用模块: 无
**
** 作　者: 陈明计
** 日　期: 2004年2月2日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/
        void TargetResetInit(void)
{
#ifdef __DEBUG_RAM    
    MEMMAP = 0x2;                   //remap
#endif

#ifdef __DEBUG_FLASH    
    MEMMAP = 0x1;                   //remap
#endif

#ifdef __IN_CHIP    
    MEMMAP = 0x1;                   //remap
#endif

    PINSEL0 = (PINSEL0 & 0xFFFF0000) | 0x05 | 0x50;

/* 设置系统各部分时钟 */
    PLLCON |= 0x01;	   /*表示使用PLL作为时钟源*/
#if (Fpclk / (Fcclk / 4)) == 1
    VPBDIV = 0;
#endif
#if (Fpclk / (Fcclk / 4)) == 2
    VPBDIV = 2;
#endif
#if (Fpclk / (Fcclk / 4)) == 4
    VPBDIV = 1;
#endif

#if (Fcco / Fcclk) == 2
    PLLCFG = ((Fcclk / Fosc) - 1) | (0 << 5);
#endif
#if (Fcco / Fcclk) == 4
    PLLCFG = ((Fcclk / Fosc) - 1) | (1 << 5);
#endif
#if (Fcco / Fcclk) == 8
    PLLCFG = ((Fcclk / Fosc) - 1) | (2 << 5);
#endif
#if (Fcco / Fcclk) == 16
    PLLCFG = ((Fcclk / Fosc) - 1) | (3 << 5);
#endif
    PLLFEED = 0xaa;
    PLLFEED = 0x55;
    while((PLLSTAT & (1 << 10)) == 0);		/*PLLSTAT的第十位若为1，则说明PLL已经锁定*/
    PLLCON = 3;
    PLLFEED = 0xaa;
    PLLFEED = 0x55;

/* 设置存储器加速模块 */
    MAMCR = 0;
#if Fcclk < 20000000
    MAMTIM = 1;
#else
#if Fcclk < 40000000
    MAMTIM = 2;
#else
    MAMTIM = 3;
#endif
#endif
    MAMCR = 2;

/* 设置串行口 */
    InitialiseUART0(115200);

/* 设置实时时钟 */
    CCR = 1;
    PREINT = Fpclk / 32768 - 1;
    PREFRAC = Fpclk - (Fpclk / 32768) * 32768;
    YEAR = 2004;
    MONTH = 3;
    DOM = 25;
    

    VICIntEnClr = 0xffffffff;
    VICVectAddr = 0;
    VICIntSelect = 0;
    T0IR = 0xffffffff;
    T0TCR = 0X02;

	



}


void __irq IRQ_Timer0(void){ /*定时器0的中断处理程序*/
  switch (T0IR)
   {case 0x01    :				  /*MR0中断，*/
               	  T0IR=0X1;		  /*相应位写入“１”将清除中断标志，写入０无效*/
                  OSTimeTick();	  /*用于任务切换的，把每一个阻塞任务的延时计数器减一，若减完已经为0，
				                  ** 若没有等待事件或信号，则在就绪表就绪组中设置相应的标志*******/

				  break;
	case 0x01<<1 :
               	  T0IR=0X1<<1;
                  break;
	case 0x01<<2 :
               	  T0IR=0X1<<2;
                  break;
	case 0x01<<3 :
               	  T0IR=0X1<<3;
                  break;
	case 0x01<<4 :					   /*CR0中断，表示捕获到了外来事件*/
		
				  T0IR=0X1<<4;		   /*写入１表示清除中断标志*/
                  break;
	case 0x01<<5 :
               	  T0IR=0X1<<5;
                  break;
	case 0x01<<6 :
               	  T0IR=0X1<<6;
                  break;
	case 0x01<<7 :
               	  T0IR=0X1<<7;
                  break;
	default      :
	              break;
    
 } 
 VICVectAddr=0x00; //中断结束

 OSIntExit();	 /*任何中断结束后都调用该函数，并在该函数中执行任务切换函数OSIntCtxSw()  */
}
